app/controllers/sessions_controller.rb

	def create
	  user = User.where(email: params[:session][:email].downcase).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test4@gmail.com' LIMIT 1