app/controllers/tracks_controller.rb

  def create
    @track = Track.new(params[:track])
    @track.user_id = current_user.id

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 05 Jan 2014 13:19:34 UTC +00:00], ["description", "asd asda sd"], ["title", "asdf"], ["updated_at", Sun, 05 Jan 2014 13:19:34 UTC +00:00], ["user_id", nil]]

  def update
    @track = Track.find(params[:id])

    unless (current_user?(@track.user) and !current_user.learns(@track))
      current_user.learn!(@track)

      @track.steps.each do |step|
        @subm = Submission.new(step_id: step.id, user_id: current_user.id, grade: 'not graded')
        @subm.save
      end

    end
    # redirect_to @track

    respond_to do |format|
      if @track.update_attributes(params[:track])
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "steps".* FROM "steps" WHERE "steps"."track_id" = 9
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
INSERT INTO "submissions" ("created_at", "grade", "step_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 13 Jan 2014 19:46:14 UTC +00:00], ["grade", "not graded"], ["step_id", 6], ["updated_at", Mon, 13 Jan 2014 19:46:14 UTC +00:00], ["user_id", nil]]
UPDATE "tracks" SET "description" = 'wewewe vvv', "updated_at" = '2014-01-13 16:00:54.242186' WHERE "tracks"."id" = 9